/* Для  Java  проекта  (локальной  папки)  построить  и  напечатать  в  консоли  обратный  индекс
наследования классов. Для каждого класса необходимо найти (напечатать) классы, для которых он
является  базовым  (родительским).  Должны  корректно  обрабатываться  ключевые  слова  class,
interface,  extends,  implements.  Необходимо  использовать  интерфейс  Map,  метод  getOrDefault().
Желательно использовать Stream API. */

public class Task2 {

    public static void main(String[] args) {

    }

}